{
  "info" : {
    "exampleOne": "Ceci est un exemple de texte un en français",
    "exampleTwo": "Ceci est un exemple de texte deux en français",
    "noData": "Il n'y a pas de données",
    "text_1": "Salut !. Je m'appelle Guillermo Ferraz. Je vis en Uruguay et je suis développeur FullStack. Depuis tout petit, ma passion est l'informatique. J'aime constamment apprendre et me mettre à jour parce que j'aime vraiment mon travail. Je vous invite à en savoir plus sur mon profil, mes connaissances et mes compétences.",
    "text_2": "Si vous êtes également développeur de logiciels, je téléchargerai bientôt du matériel sur TypeScript, React, Redux, NextJs, Node, etc. et des exemples de code à partager qui pourraient vous être utiles."
  },
  "buttons": {
    "en": "Anglais",
    "es": "Espagnol",
    "fr": "Français",
    "br": "Portugais",
    "goHomePage": "Aller à la page d'accueil",
    "exampleOne": "Exemple 1",
    "exampleTwo": "Exemple 2",
    "exampleThree": "Exemple 3",
    "cleanState": "Effacer le statut",
    "send": "Envoyer"
  },
  "title":{
    "languageSelector": "Sélecteur de langue"
  },
  "loading": {
    "pending": "Mise en charge ..."
  },
  "links":{
    "aboutMe": "Sur moi",
    "contact": "Contacter",
    "blog": "Blog",
    "portfolio": "portefeuille",
    "CV": "CV",
    "home": "Accueil"
  },
  "labels":{
    "email": "Courrier électronique",
    "name": "Nom",
    "company": "Entreprise",
    "message": "Message",
    "optional": "Optionnel"
  },
    "messages":{
    "autoResponseModalSuccess": "Merci beaucoup de nous avoir contactés. Je vous contacterai sous peu via votre email ",
    "from": "depuis "
  },
  "errors":{
    "email": "L'email saisi n'est pas valide",
    "name": "Le nom saisi n'est pas valide",
    "maxMessage": "Vous avez dépassé le nombre maximum de caractères autorisés",
    "entryMessage": "Veuillez entrer un message"
  },
  "review":{
    "p1":"Bonjour !!. Je m'appelle Guillermo Ferraz et j'habite en Uruguay. ",
    "p2":"Ma passion depuis mon plus jeune âge a été et continue d'être l'informatique. Donc, ce qui a commencé comme un jeu ou une curiosité pour voir comment fonctionne un ordinateur, ou pour enquêter sur ce qu'il a à l'intérieur, comment il fonctionne ou ce qu'il fait que ça marche, il est devenu qu'à chaque fois mon attirance pour cette branche était de plus en plus grande.",
    "p3": "Grâce à ça j'ai pu trouver ma vocation et aujourd'hui être une personne qui travaille dans ce qu'il veut vraiment travailler !",
    "p4": "Aujourd'hui, je travaille en tant que développeur de logiciels et je peux en vivre. Dans tous les cas, je me maintiens dans un apprentissage et une formation constants, car en plus d'être extrêmement nécessaire à notre croissance professionnelle, il est également nécessaire de résoudre les problèmes de code auxquels nous sommes confrontés chaque jour.",
    "p5":"Travailler en tant que développeur de logiciels n'est pas si simple, car c'est généralement quelque peu épuisant ou frustrant parfois, résoudre problème après problème, mais c'est aussi satisfaisant lorsque nous générons des solutions à ces problèmes et apprenons à le faire. Personnellement, j'aime vraiment mon travail et j'ai l'intention de continuer à m'améliorer et à grandir professionnellement.",
    "p6": "Mon objectif principal est le développement d'applications Web, de bureau ou mobiles et mon 'hobby' est la sécurité informatique. Ce 'hobby' m'a beaucoup aidé à voir les points vulnérables dans les applications que je développe, donc à acquérir ces connaissances a été bien utile pour réduire au maximum ces points vulnérables.",
    "p7":"J'écris cette brève revue sur moi-même le 26 mai 2022. Je me réfère à cette date pour vous dire la suite. Nous avons presque toujours un langage de programmation qui est notre 'fort' pour ainsi dire ou nous nous démarquons plus que le reste. Dans mon cas, ce langage est JavaScript et l'environnement ou les outils que l'on peut trouver dans le contexte de JavaScript. Personnellement, aujourd'hui, chaque fois que je vais développer une application à partir de zéro, j'utilise TypeScript et lors d'une réunion avec mes collègues se pose pour discuter de la manière dont nous allons réaliser un projet ou quelles seraient les meilleures options dont nous disposons par rapport aux exigences du projet , je recommande généralement TypeScript d'utiliser TypeScript mais si le projet aura une taille moyenne à grande et Je pense que dans quelques mois nous allons sortir une nouvelle version et il va falloir la mettre à l'échelle, car personnellement il ne fait aucun doute que ma réponse sera TypeScript. s serait la langue dans laquelle j'ai le plus d'expérience et je me démarque des autres. Dans mon CV je pourrai vous renseigner sur le reste des langages que j'ai utilisé, mais en amont je vous dirai ici que c'est ma force tant pour développer des applications côté Backend que côté Frontend.",
    "p8":"Je vous invite à jeter un œil ou à télécharger mon CV en cliquant sur le",
    "link":"lien",
    "continueP8": "ou aller dans la section CV.",
    "p9":"Le but de ce site n'est pas seulement de montrer et de faire connaître mes compétences et mon expérience, mais aussi l'idée est d'avoir mon propre site où je peux partager mes connaissances avec d'autres développeurs ou avec des personnes qui veulent commencer dans le monde du développement logiciel. Je partagerai donc périodiquement des extraits de code, des solutions et d'autres exemples qui, je l'espère, seront utiles."
  }
}
